MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q10/mcu.h
extern volatile CLC8GLS2bits_t CLC8GLS2bits __at(0xE75);
// bitfield macros
#define _CLC8GLS2_G3D1N_POSN                                0x0
#define _CLC8GLS2_G3D1N_POSITION                            0x0
#define _CLC8GLS2_G3D1N_SIZE                                0x1
#define _CLC8GLS2_G3D1N_LENGTH                              0x1
#define _CLC8GLS2_G3D1N_MASK                                0x1
#define _CLC8GLS2_G3D1T_POSN                                0x1
#define _CLC8GLS2_G3D1T_POSITION                            0x1
#define _CLC8GLS2_G3D1T_SIZE                                0x1
#define _CLC8GLS2_G3D1T_LENGTH                              0x1
#define _CLC8GLS2_G3D1T_MASK                                0x2
#define _CLC8GLS2_G3D2N_POSN                                0x2
#define _CLC8GLS2_G3D2N_POSITION                            0x2
#define _CLC8GLS2_G3D2N_SIZE                                0x1
#define _CLC8GLS2_G3D2N_LENGTH                              0x1
#define _CLC8GLS2_G3D2N_MASK                                0x4
#define _CLC8GLS2_G3D2T_POSN                                0x3
#define _CLC8GLS2_G3D2T_POSITION                            0x3
#define _CLC8GLS2_G3D2T_SIZE                                0x1
#define _CLC8GLS2_G3D2T_LENGTH                              0x1
#define _CLC8GLS2_G3D2T_MASK                                0x8
#define _CLC8GLS2_G3D3N_POSN                                0x4
#define _CLC8GLS2_G3D3N_POSITION                            0x4
#define _CLC8GLS2_G3D3N_SIZE                                0x1
#define _CLC8GLS2_G3D3N_LENGTH                              0x1
#define _CLC8GLS2_G3D3N_MASK                                0x10
#define _CLC8GLS2_G3D3T_POSN                                0x5
#define _CLC8GLS2_G3D3T_POSITION                            0x5
#define _CLC8GLS2_G3D3T_SIZE                                0x1
#define _CLC8GLS2_G3D3T_LENGTH                              0x1
#define _CLC8GLS2_G3D3T_MASK                                0x20
#define _CLC8GLS2_G3D4N_POSN                                0x6
#define _CLC8GLS2_G3D4N_POSITION                            0x6
#define _CLC8GLS2_G3D4N_SIZE                                0x1
#define _CLC8GLS2_G3D4N_LENGTH                              0x1
#define _CLC8GLS2_G3D4N_MASK                                0x40
#define _CLC8GLS2_G3D4T_POSN                                0x7
#define _CLC8GLS2_G3D4T_POSITION                            0x7
#define _CLC8GLS2_G3D4T_SIZE                                0x1
#define _CLC8GLS2_G3D4T_LENGTH                              0x1
#define _CLC8GLS2_G3D4T_MASK                                0x80
#define _CLC8GLS2_LC8G3D1N_POSN                             0x0
#define _CLC8GLS2_LC8G3D1N_POSITION                         0x0
#define _CLC8GLS2_LC8G3D1N_SIZE                             0x1
#define _CLC8GLS2_LC8G3D1N_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D1N_MASK                             0x1
#define _CLC8GLS2_LC8G3D1T_POSN                             0x1
#define _CLC8GLS2_LC8G3D1T_POSITION                         0x1
#define _CLC8GLS2_LC8G3D1T_SIZE                             0x1
#define _CLC8GLS2_LC8G3D1T_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D1T_MASK                             0x2
#define _CLC8GLS2_LC8G3D2N_POSN                             0x2
#define _CLC8GLS2_LC8G3D2N_POSITION                         0x2
#define _CLC8GLS2_LC8G3D2N_SIZE                             0x1
#define _CLC8GLS2_LC8G3D2N_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D2N_MASK                             0x4
#define _CLC8GLS2_LC8G3D2T_POSN                             0x3
#define _CLC8GLS2_LC8G3D2T_POSITION                         0x3
#define _CLC8GLS2_LC8G3D2T_SIZE                             0x1
#define _CLC8GLS2_LC8G3D2T_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D2T_MASK                             0x8
#define _CLC8GLS2_LC8G3D3N_POSN                             0x4
#define _CLC8GLS2_LC8G3D3N_POSITION                         0x4
#define _CLC8GLS2_LC8G3D3N_SIZE                             0x1
#define _CLC8GLS2_LC8G3D3N_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D3N_MASK                             0x10
#define _CLC8GLS2_LC8G3D3T_POSN                             0x5
#define _CLC8GLS2_LC8G3D3T_POSITION                         0x5
#define _CLC8GLS2_LC8G3D3T_SIZE                             0x1
#define _CLC8GLS2_LC8G3D3T_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D3T_MASK                             0x20
#define _CLC8GLS2_LC8G3D4N_POSN                             0x6
#define _CLC8GLS2_LC8G3D4N_POSITION                         0x6
#define _CLC8GLS2_LC8G3D4N_SIZE                             0x1
#define _CLC8GLS2_LC8G3D4N_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D4N_MASK                             0x40
#define _CLC8GLS2_LC8G3D4T_POSN                             0x7
#define _CLC8GLS2_LC8G3D4T_POSITION                         0x7
#define _CLC8GLS2_LC8G3D4T_SIZE                             0x1
#define _CLC8GLS2_LC8G3D4T_LENGTH                           0x1
#define _CLC8GLS2_LC8G3D4T_MASK                             0x80

// Register: CLC8GLS3
#define CLC8GLS3 CLC8GLS3
extern volatile unsigned char           CLC8GLS3            __at(0xE76);
#ifndef _LIB_BUILD
asm("CLC8GLS3 equ 0E76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
    struct {
        unsigned LC8G4D1N               :1;
        unsigned LC8G4D1T               :1;
        unsigned LC8G4D2N               :1;
        unsigned LC8G4D2T               :1;
        unsigned LC8G4D3N               :1;
        unsigned LC8G4D3T               :1;
        unsigned LC8G4D4N               :1;
        unsigned LC8G4D4T               :1;
    };
} CLC8GLS3bits_t;
extern volatile CLC8GLS3bits_t CLC8GLS3bits __at(0xE76);
// bitfield macros
#define _CLC8GLS3_G4D1N_POSN                                0x0
#define _CLC8GLS3_G4D1N_POSITION                            0x0
#define _CLC8GLS3_G4D1N_SIZE                                0x1
#define _CLC8GLS3_G4D1N_LENGTH                              0x1
#define _CLC8GLS3_G4D1N_MASK                                0x1
#define _CLC8GLS3_G4D1T_POSN                                0x1
#define _CLC8GLS3_G4D1T_POSITION                            0x1
#define _CLC8GLS3_G4D1T_SIZE                                0x1
#define _CLC8GLS3_G4D1T_LENGTH                              0x1
#define _CLC8GLS3_G4D1T_MASK                                0x2
#define _CLC8GLS3_G4D2N_POSN                                0x2
#define _CLC8GLS3_G4D2N_POSITION                            0x2
#define _CLC8GLS3_G4D2N_SIZE                                0x1
#define _CLC8GLS3_G4D2N_LENGTH                              0x1
#define _CLC8GLS3_G4D2N_MASK                                0x4
#define _CLC8GLS3_G4D2T_POSN                                0x3
#define _CLC8GLS3_G4D2T_POSITION                            0x3
#define _CLC8GLS3_G4D2T_SIZE                                0x1
#define _CLC8GLS3_G4D2T_LENGTH                              0x1
#define _CLC8GLS3_G4D2T_MASK                                0x8
#define _CLC8GLS3_G4D3N_POSN                                0x4
#define _CLC8GLS3_G4D3N_POSITION                            0x4
#define _CLC8GLS3_G4D3N_SIZE                                0x1
#define _CLC8GLS3_G4D3N_LENGTH                              0x1
#define _CLC8GLS3_G4D3N_MASK                                0x10
#define _CLC8GLS3_G4D3T_POSN                                0x5
#define _CLC8GLS3_G4D3T_POSITION                            0x5
#define _CLC8GLS3_G4D3T_SIZE                                0x1
#define _CLC8GLS3_G4D3T_LENGTH                              0x1
#define _CLC8GLS3_G4D3T_MASK                                0x20
#define _CLC8GLS3_G4D4N_POSN                                0x6
#define _CLC8GLS3_G4D4N_POSITION                            0x6
#define _CLC8GLS3_G4D4N_SIZE                                0x1
#define _CLC8GLS3_G4D4N_LENGTH                              0x1
#define _CLC8GLS3_G4D4N_MASK                                0x40
#define _CLC8GLS3_G4D4T_POSN                                0x7
#define _CLC8GLS3_G4D4T_POSITION                            0x7
#define _CLC8GLS3_G4D4T_SIZE                                0x1
#define _CLC8GLS3_G4D4T_LENGTH                              0x1
#define _CLC8GLS3_G4D4T_MASK                                0x80
#define _CLC8GLS3_LC8G4D1N_POSN                             0x0
#define _CLC8GLS3_LC8G4D1N_POSITION                         0x0
#define _CLC8GLS3_LC8G4D1N_SIZE                             0x1
#define _CLC8GLS3_LC8G4D1N_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D1N_MASK                             0x1
#define _CLC8GLS3_LC8G4D1T_POSN                             0x1
#define _CLC8GLS3_LC8G4D1T_POSITION                         0x1
#define _CLC8GLS3_LC8G4D1T_SIZE                             0x1
#define _CLC8GLS3_LC8G4D1T_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D1T_MASK                             0x2
#define _CLC8GLS3_LC8G4D2N_POSN                             0x2
#define _CLC8GLS3_LC8G4D2N_POSITION                         0x2
#define _CLC8GLS3_LC8G4D2N_SIZE                             0x1
#define _CLC8GLS3_LC8G4D2N_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D2N_MASK                             0x4
#define _CLC8GLS3_LC8G4D2T_POSN                             0x3
#define _CLC8GLS3_LC8G4D2T_POSITION                         0x3
#define _CLC8GLS3_LC8G4D2T_SIZE                             0x1
#define _CLC8GLS3_LC8G4D2T_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D2T_MASK                             0x8
#define _CLC8GLS3_LC8G4D3N_POSN                             0x4
#define _CLC8GLS3_LC8G4D3N_POSITION                         0x4
#define _CLC8GLS3_LC8G4D3N_SIZE                             0x1
#define _CLC8GLS3_LC8G4D3N_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D3N_MASK                             0x10
#define _CLC8GLS3_LC8G4D3T_POSN                             0x5
#define _CLC8GLS3_LC8G4D3T_POSITION                         0x5
#define _CLC8GLS3_LC8G4D3T_SIZE                             0x1
#define _CLC8GLS3_LC8G4D3T_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D3T_MASK                             0x20
#define _CLC8GLS3_LC8G4D4N_POSN                             0x6
#define _CLC8GLS3_LC8G4D4N_POSITION                         0x6
#define _CLC8GLS3_LC8G4D4N_SIZE                             0x1
#define _CLC8GLS3_LC8G4D4N_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D4N_MASK                             0x40
#define _CLC8GLS3_LC8G4D4T_POSN                             0x7
#define _CLC8GLS3_LC8G4D4T_POSITION                         0x7
#define _CLC8GLS3_LC8G4D4T_SIZE                             0x1
#define _CLC8GLS3_LC8G4D4T_LENGTH                           0x1
#define _CLC8GLS3_LC8G4D4T_MASK                             0x80

// Register: CLCDATA
#define CLCDATA CLCDATA
extern volatile unsigned char           CLCDATA             __at(0xE77);
#ifndef _LIB_BUILD
asm("CLCDATA equ 0E77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MCL1OUT                :1;
        unsigned MLC2OUT                :1;
        unsigned MLC3OUT                :1;
        unsigned MLC4OUT                :1;
        unsigned MLC5OUT                :1;
        unsigned MLC6OUT                :1;
        unsigned MLC7OUT                :1;
        unsigned MLC8OUT                :1;
    };
} CLCDATAbits_t;
