MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q10/mcu.h
extern volatile IPR7bits_t IPR7bits __at(0xEBC);
// bitfield macros
#define _IPR7_CWGIP_POSN                                    0x0
#define _IPR7_CWGIP_POSITION                                0x0
#define _IPR7_CWGIP_SIZE                                    0x1
#define _IPR7_CWGIP_LENGTH                                  0x1
#define _IPR7_CWGIP_MASK                                    0x1
#define _IPR7_NVMIP_POSN                                    0x5
#define _IPR7_NVMIP_POSITION                                0x5
#define _IPR7_NVMIP_SIZE                                    0x1
#define _IPR7_NVMIP_LENGTH                                  0x1
#define _IPR7_NVMIP_MASK                                    0x20
#define _IPR7_CRCIP_POSN                                    0x6
#define _IPR7_CRCIP_POSITION                                0x6
#define _IPR7_CRCIP_SIZE                                    0x1
#define _IPR7_CRCIP_LENGTH                                  0x1
#define _IPR7_CRCIP_MASK                                    0x40
#define _IPR7_SCANIP_POSN                                   0x7
#define _IPR7_SCANIP_POSITION                               0x7
#define _IPR7_SCANIP_SIZE                                   0x1
#define _IPR7_SCANIP_LENGTH                                 0x1
#define _IPR7_SCANIP_MASK                                   0x80
#define _IPR7_CWG1IP_POSN                                   0x0
#define _IPR7_CWG1IP_POSITION                               0x0
#define _IPR7_CWG1IP_SIZE                                   0x1
#define _IPR7_CWG1IP_LENGTH                                 0x1
#define _IPR7_CWG1IP_MASK                                   0x1

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0xEBD);
#ifndef _LIB_BUILD
asm("PIE0 equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned INT1IE                 :1;
        unsigned INT2IE                 :1;
        unsigned                        :1;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0xEBD);
// bitfield macros
#define _PIE0_INT0IE_POSN                                   0x0
#define _PIE0_INT0IE_POSITION                               0x0
#define _PIE0_INT0IE_SIZE                                   0x1
#define _PIE0_INT0IE_LENGTH                                 0x1
#define _PIE0_INT0IE_MASK                                   0x1
#define _PIE0_INT1IE_POSN                                   0x1
#define _PIE0_INT1IE_POSITION                               0x1
#define _PIE0_INT1IE_SIZE                                   0x1
#define _PIE0_INT1IE_LENGTH                                 0x1
#define _PIE0_INT1IE_MASK                                   0x2
#define _PIE0_INT2IE_POSN                                   0x2
#define _PIE0_INT2IE_POSITION                               0x2
#define _PIE0_INT2IE_SIZE                                   0x1
#define _PIE0_INT2IE_LENGTH                                 0x1
#define _PIE0_INT2IE_MASK                                   0x4
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xEBE);
#ifndef _LIB_BUILD
asm("PIE1 equ 0EBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned                        :4;
        unsigned CSWIE                  :1;
        unsigned OSCFIE                 :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0xEBE);
// bitfield macros
#define _PIE1_ADIE_POSN                                     0x0
#define _PIE1_ADIE_POSITION                                 0x0
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x1
#define _PIE1_ADTIE_POSN                                    0x1
#define _PIE1_ADTIE_POSITION                                0x1
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x2
#define _PIE1_CSWIE_POSN                                    0x6
#define _PIE1_CSWIE_POSITION                                0x6
#define _PIE1_CSWIE_SIZE                                    0x1
#define _PIE1_CSWIE_LENGTH                                  0x1
#define _PIE1_CSWIE_MASK                                    0x40
#define _PIE1_OSCFIE_POSN                                   0x7
#define _PIE1_OSCFIE_POSITION                               0x7
#define _PIE1_OSCFIE_SIZE                                   0x1
#define _PIE1_OSCFIE_LENGTH                                 0x1
#define _PIE1_OSCFIE_MASK                                   0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0xEBF);
#ifndef _LIB_BUILD
asm("PIE2 equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IE                   :1;
        unsigned C2IE                   :1;
        unsigned                        :4;
        unsigned ZCDIE                  :1;
        unsigned HLVDIE                 :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0xEBF);
// bitfield macros
#define _PIE2_C1IE_POSN                                     0x0
#define _PIE2_C1IE_POSITION                                 0x0
#define _PIE2_C1IE_SIZE                                     0x1
#define _PIE2_C1IE_LENGTH                                   0x1
#define _PIE2_C1IE_MASK                                     0x1
#define _PIE2_C2IE_POSN                                     0x1
#define _PIE2_C2IE_POSITION                                 0x1
#define _PIE2_C2IE_SIZE                                     0x1
#define _PIE2_C2IE_LENGTH                                   0x1
#define _PIE2_C2IE_MASK                                     0x2
#define _PIE2_ZCDIE_POSN                                    0x6
#define _PIE2_ZCDIE_POSITION                                0x6
#define _PIE2_ZCDIE_SIZE                                    0x1
#define _PIE2_ZCDIE_LENGTH                                  0x1
#define _PIE2_ZCDIE_MASK                                    0x40
#define _PIE2_HLVDIE_POSN                                   0x7
#define _PIE2_HLVDIE_POSITION                               0x7
#define _PIE2_HLVDIE_SIZE                                   0x1
#define _PIE2_HLVDIE_LENGTH                                 0x1
#define _PIE2_HLVDIE_MASK                                   0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0xEC0);
#ifndef _LIB_BUILD
asm("PIE3 equ 0EC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPIE                  :1;
        unsigned BCLIE                  :1;
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned TXIE                   :1;
        unsigned RCIE                   :1;
        unsigned TX2IE                  :1;
        unsigned RC2IE                  :1;
    };
    struct {
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned                        :2;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0xEC0);
// bitfield macros
#define _PIE3_SSPIE_POSN                                    0x0
#define _PIE3_SSPIE_POSITION                                0x0
#define _PIE3_SSPIE_SIZE                                    0x1
#define _PIE3_SSPIE_LENGTH                                  0x1
#define _PIE3_SSPIE_MASK                                    0x1
#define _PIE3_BCLIE_POSN                                    0x1
#define _PIE3_BCLIE_POSITION                                0x1
#define _PIE3_BCLIE_SIZE                                    0x1
#define _PIE3_BCLIE_LENGTH                                  0x1
#define _PIE3_BCLIE_MASK                                    0x2
#define _PIE3_SSP2IE_POSN                                   0x2
#define _PIE3_SSP2IE_POSITION                               0x2
#define _PIE3_SSP2IE_SIZE                                   0x1
#define _PIE3_SSP2IE_LENGTH                                 0x1
#define _PIE3_SSP2IE_MASK                                   0x4
#define _PIE3_BCL2IE_POSN                                   0x3
#define _PIE3_BCL2IE_POSITION                               0x3
#define _PIE3_BCL2IE_SIZE                                   0x1
#define _PIE3_BCL2IE_LENGTH                                 0x1
#define _PIE3_BCL2IE_MASK                                   0x8
#define _PIE3_TXIE_POSN                                     0x4
#define _PIE3_TXIE_POSITION                                 0x4
#define _PIE3_TXIE_SIZE                                     0x1
#define _PIE3_TXIE_LENGTH                                   0x1
#define _PIE3_TXIE_MASK                                     0x10
#define _PIE3_RCIE_POSN                                     0x5
#define _PIE3_RCIE_POSITION                                 0x5
#define _PIE3_RCIE_SIZE                                     0x1
#define _PIE3_RCIE_LENGTH                                   0x1
#define _PIE3_RCIE_MASK                                     0x20
#define _PIE3_TX2IE_POSN                                    0x6
#define _PIE3_TX2IE_POSITION                                0x6
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x40
#define _PIE3_RC2IE_POSN                                    0x7
#define _PIE3_RC2IE_POSITION                                0x7
#define _PIE3_RC2IE_SIZE                                    0x1
#define _PIE3_RC2IE_LENGTH                                  0x1
#define _PIE3_RC2IE_MASK                                    0x80
#define _PIE3_SSP1IE_POSN                                   0x0
#define _PIE3_SSP1IE_POSITION                               0x0
#define _PIE3_SSP1IE_SIZE                                   0x1
#define _PIE3_SSP1IE_LENGTH                                 0x1
#define _PIE3_SSP1IE_MASK                                   0x1
#define _PIE3_BCL1IE_POSN                                   0x1
#define _PIE3_BCL1IE_POSITION                               0x1
#define _PIE3_BCL1IE_SIZE                                   0x1
#define _PIE3_BCL1IE_LENGTH                                 0x1
#define _PIE3_BCL1IE_MASK                                   0x2
#define _PIE3_TX1IE_POSN                                    0x4
#define _PIE3_TX1IE_POSITION                                0x4
#define _PIE3_TX1IE_SIZE                                    0x1
#define _PIE3_TX1IE_LENGTH                                  0x1
#define _PIE3_TX1IE_MASK                                    0x10
#define _PIE3_RC1IE_POSN                                    0x5
#define _PIE3_RC1IE_POSITION                                0x5
#define _PIE3_RC1IE_SIZE                                    0x1
#define _PIE3_RC1IE_LENGTH                                  0x1
#define _PIE3_RC1IE_MASK                                    0x20

