MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q10/mcu.h
extern volatile OSCFREQbits_t OSCFREQbits __at(0xED9);
// bitfield macros
#define _OSCFREQ_HFFRQ_POSN                                 0x0
#define _OSCFREQ_HFFRQ_POSITION                             0x0
#define _OSCFREQ_HFFRQ_SIZE                                 0x4
#define _OSCFREQ_HFFRQ_LENGTH                               0x4
#define _OSCFREQ_HFFRQ_MASK                                 0xF
#define _OSCFREQ_FRQ0_POSN                                  0x0
#define _OSCFREQ_FRQ0_POSITION                              0x0
#define _OSCFREQ_FRQ0_SIZE                                  0x1
#define _OSCFREQ_FRQ0_LENGTH                                0x1
#define _OSCFREQ_FRQ0_MASK                                  0x1
#define _OSCFREQ_FRQ1_POSN                                  0x1
#define _OSCFREQ_FRQ1_POSITION                              0x1
#define _OSCFREQ_FRQ1_SIZE                                  0x1
#define _OSCFREQ_FRQ1_LENGTH                                0x1
#define _OSCFREQ_FRQ1_MASK                                  0x2
#define _OSCFREQ_FRQ2_POSN                                  0x2
#define _OSCFREQ_FRQ2_POSITION                              0x2
#define _OSCFREQ_FRQ2_SIZE                                  0x1
#define _OSCFREQ_FRQ2_LENGTH                                0x1
#define _OSCFREQ_FRQ2_MASK                                  0x4
#define _OSCFREQ_FRQ3_POSN                                  0x3
#define _OSCFREQ_FRQ3_POSITION                              0x3
#define _OSCFREQ_FRQ3_SIZE                                  0x1
#define _OSCFREQ_FRQ3_LENGTH                                0x1
#define _OSCFREQ_FRQ3_MASK                                  0x8

// Register: VREGCON
#define VREGCON VREGCON
extern volatile unsigned char           VREGCON             __at(0xEDA);
#ifndef _LIB_BUILD
asm("VREGCON equ 0EDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VREGPM                 :2;
        unsigned                        :2;
        unsigned PMSYS                  :2;
    };
    struct {
        unsigned VREGPM0                :1;
        unsigned VREGPM1                :1;
        unsigned                        :2;
        unsigned PMSYS0                 :1;
        unsigned PMSYS1                 :1;
    };
} VREGCONbits_t;
extern volatile VREGCONbits_t VREGCONbits __at(0xEDA);
// bitfield macros
#define _VREGCON_VREGPM_POSN                                0x0
#define _VREGCON_VREGPM_POSITION                            0x0
#define _VREGCON_VREGPM_SIZE                                0x2
#define _VREGCON_VREGPM_LENGTH                              0x2
#define _VREGCON_VREGPM_MASK                                0x3
#define _VREGCON_PMSYS_POSN                                 0x4
#define _VREGCON_PMSYS_POSITION                             0x4
#define _VREGCON_PMSYS_SIZE                                 0x2
#define _VREGCON_PMSYS_LENGTH                               0x2
#define _VREGCON_PMSYS_MASK                                 0x30
#define _VREGCON_VREGPM0_POSN                               0x0
#define _VREGCON_VREGPM0_POSITION                           0x0
#define _VREGCON_VREGPM0_SIZE                               0x1
#define _VREGCON_VREGPM0_LENGTH                             0x1
#define _VREGCON_VREGPM0_MASK                               0x1
#define _VREGCON_VREGPM1_POSN                               0x1
#define _VREGCON_VREGPM1_POSITION                           0x1
#define _VREGCON_VREGPM1_SIZE                               0x1
#define _VREGCON_VREGPM1_LENGTH                             0x1
#define _VREGCON_VREGPM1_MASK                               0x2
#define _VREGCON_PMSYS0_POSN                                0x4
#define _VREGCON_PMSYS0_POSITION                            0x4
#define _VREGCON_PMSYS0_SIZE                                0x1
#define _VREGCON_PMSYS0_LENGTH                              0x1
#define _VREGCON_PMSYS0_MASK                                0x10
#define _VREGCON_PMSYS1_POSN                                0x5
#define _VREGCON_PMSYS1_POSITION                            0x5
#define _VREGCON_PMSYS1_SIZE                                0x1
#define _VREGCON_PMSYS1_LENGTH                              0x1
#define _VREGCON_PMSYS1_MASK                                0x20

// Register: BORCON
#define BORCON BORCON
extern volatile unsigned char           BORCON              __at(0xEDB);
#ifndef _LIB_BUILD
asm("BORCON equ 0EDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BORRDY                 :1;
        unsigned                        :6;
        unsigned SBOREN                 :1;
    };
} BORCONbits_t;
extern volatile BORCONbits_t BORCONbits __at(0xEDB);
// bitfield macros
#define _BORCON_BORRDY_POSN                                 0x0
#define _BORCON_BORRDY_POSITION                             0x0
#define _BORCON_BORRDY_SIZE                                 0x1
#define _BORCON_BORRDY_LENGTH                               0x1
#define _BORCON_BORRDY_MASK                                 0x1
#define _BORCON_SBOREN_POSN                                 0x7
#define _BORCON_SBOREN_POSITION                             0x7
#define _BORCON_SBOREN_SIZE                                 0x1
#define _BORCON_SBOREN_LENGTH                               0x1
#define _BORCON_SBOREN_MASK                                 0x80

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xEDC);
#ifndef _LIB_BUILD
asm("PMD0 equ 0EDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned NVMMD                  :1;
        unsigned SCANMD                 :1;
        unsigned CRCMD                  :1;
        unsigned HLVDMD                 :1;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
