MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q10/mcu.h
extern volatile PR5bits_t PR5bits __at(0xFC5);
// bitfield macros
#define _PR5_CS_POSN                                        0x0
#define _PR5_CS_POSITION                                    0x0
#define _PR5_CS_SIZE                                        0x8
#define _PR5_CS_LENGTH                                      0x8
#define _PR5_CS_MASK                                        0xFF
#define _PR5_T5CS0_POSN                                     0x0
#define _PR5_T5CS0_POSITION                                 0x0
#define _PR5_T5CS0_SIZE                                     0x1
#define _PR5_T5CS0_LENGTH                                   0x1
#define _PR5_T5CS0_MASK                                     0x1
#define _PR5_T5CS1_POSN                                     0x1
#define _PR5_T5CS1_POSITION                                 0x1
#define _PR5_T5CS1_SIZE                                     0x1
#define _PR5_T5CS1_LENGTH                                   0x1
#define _PR5_T5CS1_MASK                                     0x2
#define _PR5_T5CS2_POSN                                     0x2
#define _PR5_T5CS2_POSITION                                 0x2
#define _PR5_T5CS2_SIZE                                     0x1
#define _PR5_T5CS2_LENGTH                                   0x1
#define _PR5_T5CS2_MASK                                     0x4
#define _PR5_T5CS3_POSN                                     0x3
#define _PR5_T5CS3_POSITION                                 0x3
#define _PR5_T5CS3_SIZE                                     0x1
#define _PR5_T5CS3_LENGTH                                   0x1
#define _PR5_T5CS3_MASK                                     0x8
#define _PR5_T5CS4_POSN                                     0x4
#define _PR5_T5CS4_POSITION                                 0x4
#define _PR5_T5CS4_SIZE                                     0x1
#define _PR5_T5CS4_LENGTH                                   0x1
#define _PR5_T5CS4_MASK                                     0x10
#define _PR5_CS0_POSN                                       0x0
#define _PR5_CS0_POSITION                                   0x0
#define _PR5_CS0_SIZE                                       0x1
#define _PR5_CS0_LENGTH                                     0x1
#define _PR5_CS0_MASK                                       0x1
#define _PR5_CS1_POSN                                       0x1
#define _PR5_CS1_POSITION                                   0x1
#define _PR5_CS1_SIZE                                       0x1
#define _PR5_CS1_LENGTH                                     0x1
#define _PR5_CS1_MASK                                       0x2
#define _PR5_CS2_POSN                                       0x2
#define _PR5_CS2_POSITION                                   0x2
#define _PR5_CS2_SIZE                                       0x1
#define _PR5_CS2_LENGTH                                     0x1
#define _PR5_CS2_MASK                                       0x4
#define _PR5_CS3_POSN                                       0x3
#define _PR5_CS3_POSITION                                   0x3
#define _PR5_CS3_SIZE                                       0x1
#define _PR5_CS3_LENGTH                                     0x1
#define _PR5_CS3_MASK                                       0x8
#define _PR5_CS4_POSN                                       0x4
#define _PR5_CS4_POSITION                                   0x4
#define _PR5_CS4_SIZE                                       0x1
#define _PR5_CS4_LENGTH                                     0x1
#define _PR5_CS4_MASK                                       0x10

// Register: TMR3
#define TMR3 TMR3
extern volatile unsigned short          TMR3                __at(0xFC6);
#ifndef _LIB_BUILD
asm("TMR3 equ 0FC6h");
#endif

// Register: TMR3L
#define TMR3L TMR3L
extern volatile unsigned char           TMR3L               __at(0xFC6);
#ifndef _LIB_BUILD
asm("TMR3L equ 0FC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3L                  :8;
    };
    struct {
        unsigned TMR3L0                 :1;
        unsigned TMR3L1                 :1;
        unsigned TMR3L2                 :1;
        unsigned TMR3L3                 :1;
        unsigned TMR3L4                 :1;
        unsigned TMR3L5                 :1;
        unsigned TMR3L6                 :1;
        unsigned TMR3L7                 :1;
    };
    struct {
        unsigned TMR30                  :1;
        unsigned TMR31                  :1;
        unsigned TMR32                  :1;
        unsigned TMR33                  :1;
        unsigned TMR34                  :1;
        unsigned TMR35                  :1;
        unsigned TMR36                  :1;
        unsigned TMR37                  :1;
    };
} TMR3Lbits_t;
extern volatile TMR3Lbits_t TMR3Lbits __at(0xFC6);
// bitfield macros
#define _TMR3L_TMR3L_POSN                                   0x0
#define _TMR3L_TMR3L_POSITION                               0x0
#define _TMR3L_TMR3L_SIZE                                   0x8
#define _TMR3L_TMR3L_LENGTH                                 0x8
#define _TMR3L_TMR3L_MASK                                   0xFF
#define _TMR3L_TMR3L0_POSN                                  0x0
#define _TMR3L_TMR3L0_POSITION                              0x0
#define _TMR3L_TMR3L0_SIZE                                  0x1
#define _TMR3L_TMR3L0_LENGTH                                0x1
#define _TMR3L_TMR3L0_MASK                                  0x1
#define _TMR3L_TMR3L1_POSN                                  0x1
#define _TMR3L_TMR3L1_POSITION                              0x1
#define _TMR3L_TMR3L1_SIZE                                  0x1
#define _TMR3L_TMR3L1_LENGTH                                0x1
#define _TMR3L_TMR3L1_MASK                                  0x2
#define _TMR3L_TMR3L2_POSN                                  0x2
#define _TMR3L_TMR3L2_POSITION                              0x2
#define _TMR3L_TMR3L2_SIZE                                  0x1
#define _TMR3L_TMR3L2_LENGTH                                0x1
#define _TMR3L_TMR3L2_MASK                                  0x4
#define _TMR3L_TMR3L3_POSN                                  0x3
#define _TMR3L_TMR3L3_POSITION                              0x3
#define _TMR3L_TMR3L3_SIZE                                  0x1
#define _TMR3L_TMR3L3_LENGTH                                0x1
#define _TMR3L_TMR3L3_MASK                                  0x8
#define _TMR3L_TMR3L4_POSN                                  0x4
#define _TMR3L_TMR3L4_POSITION                              0x4
#define _TMR3L_TMR3L4_SIZE                                  0x1
#define _TMR3L_TMR3L4_LENGTH                                0x1
#define _TMR3L_TMR3L4_MASK                                  0x10
#define _TMR3L_TMR3L5_POSN                                  0x5
#define _TMR3L_TMR3L5_POSITION                              0x5
#define _TMR3L_TMR3L5_SIZE                                  0x1
#define _TMR3L_TMR3L5_LENGTH                                0x1
#define _TMR3L_TMR3L5_MASK                                  0x20
#define _TMR3L_TMR3L6_POSN                                  0x6
#define _TMR3L_TMR3L6_POSITION                              0x6
#define _TMR3L_TMR3L6_SIZE                                  0x1
#define _TMR3L_TMR3L6_LENGTH                                0x1
#define _TMR3L_TMR3L6_MASK                                  0x40
#define _TMR3L_TMR3L7_POSN                                  0x7
#define _TMR3L_TMR3L7_POSITION                              0x7
#define _TMR3L_TMR3L7_SIZE                                  0x1
#define _TMR3L_TMR3L7_LENGTH                                0x1
#define _TMR3L_TMR3L7_MASK                                  0x80
#define _TMR3L_TMR30_POSN                                   0x0
#define _TMR3L_TMR30_POSITION                               0x0
#define _TMR3L_TMR30_SIZE                                   0x1
#define _TMR3L_TMR30_LENGTH                                 0x1
#define _TMR3L_TMR30_MASK                                   0x1
#define _TMR3L_TMR31_POSN                                   0x1
#define _TMR3L_TMR31_POSITION                               0x1
#define _TMR3L_TMR31_SIZE                                   0x1
#define _TMR3L_TMR31_LENGTH                                 0x1
#define _TMR3L_TMR31_MASK                                   0x2
#define _TMR3L_TMR32_POSN                                   0x2
#define _TMR3L_TMR32_POSITION                               0x2
#define _TMR3L_TMR32_SIZE                                   0x1
#define _TMR3L_TMR32_LENGTH                                 0x1
#define _TMR3L_TMR32_MASK                                   0x4
#define _TMR3L_TMR33_POSN                                   0x3
#define _TMR3L_TMR33_POSITION                               0x3
#define _TMR3L_TMR33_SIZE                                   0x1
#define _TMR3L_TMR33_LENGTH                                 0x1
#define _TMR3L_TMR33_MASK                                   0x8
#define _TMR3L_TMR34_POSN                                   0x4
#define _TMR3L_TMR34_POSITION                               0x4
#define _TMR3L_TMR34_SIZE                                   0x1
#define _TMR3L_TMR34_LENGTH                                 0x1
#define _TMR3L_TMR34_MASK                                   0x10
#define _TMR3L_TMR35_POSN                                   0x5
#define _TMR3L_TMR35_POSITION                               0x5
#define _TMR3L_TMR35_SIZE                                   0x1
#define _TMR3L_TMR35_LENGTH                                 0x1
#define _TMR3L_TMR35_MASK                                   0x20
#define _TMR3L_TMR36_POSN                                   0x6
#define _TMR3L_TMR36_POSITION                               0x6
#define _TMR3L_TMR36_SIZE                                   0x1
#define _TMR3L_TMR36_LENGTH                                 0x1
#define _TMR3L_TMR36_MASK                                   0x40
#define _TMR3L_TMR37_POSN                                   0x7
#define _TMR3L_TMR37_POSITION                               0x7
#define _TMR3L_TMR37_SIZE                                   0x1
#define _TMR3L_TMR37_LENGTH                                 0x1
#define _TMR3L_TMR37_MASK                                   0x80

