MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q10/mcu.h
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x7270);	// @ (0xE4E * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x7271);	// @ (0xE4E * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x7272);	// @ (0xE4E * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x7273);	// @ (0xE4E * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x7274);	// @ (0xE4E * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x7275);	// @ (0xE4E * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x7276);	// @ (0xE4E * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x7277);	// @ (0xE4E * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x722B);	// @ (0xE45 * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x722C);	// @ (0xE45 * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7228);	// @ (0xE45 * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7229);	// @ (0xE45 * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x722A);	// @ (0xE45 * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x722D);	// @ (0xE45 * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// CLC5SEL0<LC5D1S0>
extern volatile __bit                   LC5D1S0             __at(0x7288);	// @ (0xE51 * 8 + 0)
#define                                 LC5D1S0_bit         _BIT_ACCESS(CLC5SEL0,0)
// CLC5SEL0<LC5D1S1>
extern volatile __bit                   LC5D1S1             __at(0x7289);	// @ (0xE51 * 8 + 1)
#define                                 LC5D1S1_bit         _BIT_ACCESS(CLC5SEL0,1)
// CLC5SEL0<LC5D1S2>
extern volatile __bit                   LC5D1S2             __at(0x728A);	// @ (0xE51 * 8 + 2)
#define                                 LC5D1S2_bit         _BIT_ACCESS(CLC5SEL0,2)
// CLC5SEL0<LC5D1S3>
extern volatile __bit                   LC5D1S3             __at(0x728B);	// @ (0xE51 * 8 + 3)
#define                                 LC5D1S3_bit         _BIT_ACCESS(CLC5SEL0,3)
// CLC5SEL0<LC5D1S4>
extern volatile __bit                   LC5D1S4             __at(0x728C);	// @ (0xE51 * 8 + 4)
#define                                 LC5D1S4_bit         _BIT_ACCESS(CLC5SEL0,4)
// CLC5SEL0<LC5D1S5>
extern volatile __bit                   LC5D1S5             __at(0x728D);	// @ (0xE51 * 8 + 5)
#define                                 LC5D1S5_bit         _BIT_ACCESS(CLC5SEL0,5)
// CLC5SEL0<LC5D1S6>
extern volatile __bit                   LC5D1S6             __at(0x728E);	// @ (0xE51 * 8 + 6)
#define                                 LC5D1S6_bit         _BIT_ACCESS(CLC5SEL0,6)
// CLC5SEL0<LC5D1S7>
extern volatile __bit                   LC5D1S7             __at(0x728F);	// @ (0xE51 * 8 + 7)
#define                                 LC5D1S7_bit         _BIT_ACCESS(CLC5SEL0,7)
// CLC5SEL1<LC5D2S0>
extern volatile __bit                   LC5D2S0             __at(0x7290);	// @ (0xE52 * 8 + 0)
#define                                 LC5D2S0_bit         _BIT_ACCESS(CLC5SEL1,0)
// CLC5SEL1<LC5D2S1>
extern volatile __bit                   LC5D2S1             __at(0x7291);	// @ (0xE52 * 8 + 1)
#define                                 LC5D2S1_bit         _BIT_ACCESS(CLC5SEL1,1)
// CLC5SEL1<LC5D2S2>
extern volatile __bit                   LC5D2S2             __at(0x7292);	// @ (0xE52 * 8 + 2)
#define                                 LC5D2S2_bit         _BIT_ACCESS(CLC5SEL1,2)
// CLC5SEL1<LC5D2S3>
extern volatile __bit                   LC5D2S3             __at(0x7293);	// @ (0xE52 * 8 + 3)
#define                                 LC5D2S3_bit         _BIT_ACCESS(CLC5SEL1,3)
// CLC5SEL1<LC5D2S4>
extern volatile __bit                   LC5D2S4             __at(0x7294);	// @ (0xE52 * 8 + 4)
#define                                 LC5D2S4_bit         _BIT_ACCESS(CLC5SEL1,4)
// CLC5SEL1<LC5D2S5>
extern volatile __bit                   LC5D2S5             __at(0x7295);	// @ (0xE52 * 8 + 5)
#define                                 LC5D2S5_bit         _BIT_ACCESS(CLC5SEL1,5)
// CLC5SEL1<LC5D2S6>
extern volatile __bit                   LC5D2S6             __at(0x7296);	// @ (0xE52 * 8 + 6)
#define                                 LC5D2S6_bit         _BIT_ACCESS(CLC5SEL1,6)
// CLC5SEL1<LC5D2S7>
extern volatile __bit                   LC5D2S7             __at(0x7297);	// @ (0xE52 * 8 + 7)
#define                                 LC5D2S7_bit         _BIT_ACCESS(CLC5SEL1,7)
// CLC5SEL2<LC5D3S0>
extern volatile __bit                   LC5D3S0             __at(0x7298);	// @ (0xE53 * 8 + 0)
#define                                 LC5D3S0_bit         _BIT_ACCESS(CLC5SEL2,0)
// CLC5SEL2<LC5D3S1>
extern volatile __bit                   LC5D3S1             __at(0x7299);	// @ (0xE53 * 8 + 1)
#define                                 LC5D3S1_bit         _BIT_ACCESS(CLC5SEL2,1)
// CLC5SEL2<LC5D3S2>
extern volatile __bit                   LC5D3S2             __at(0x729A);	// @ (0xE53 * 8 + 2)
#define                                 LC5D3S2_bit         _BIT_ACCESS(CLC5SEL2,2)
// CLC5SEL2<LC5D3S3>
extern volatile __bit                   LC5D3S3             __at(0x729B);	// @ (0xE53 * 8 + 3)
#define                                 LC5D3S3_bit         _BIT_ACCESS(CLC5SEL2,3)
// CLC5SEL2<LC5D3S4>
extern volatile __bit                   LC5D3S4             __at(0x729C);	// @ (0xE53 * 8 + 4)
#define                                 LC5D3S4_bit         _BIT_ACCESS(CLC5SEL2,4)
// CLC5SEL2<LC5D3S5>
extern volatile __bit                   LC5D3S5             __at(0x729D);	// @ (0xE53 * 8 + 5)
#define                                 LC5D3S5_bit         _BIT_ACCESS(CLC5SEL2,5)
// CLC5SEL2<LC5D3S6>
extern volatile __bit                   LC5D3S6             __at(0x729E);	// @ (0xE53 * 8 + 6)
#define                                 LC5D3S6_bit         _BIT_ACCESS(CLC5SEL2,6)
// CLC5SEL2<LC5D3S7>
extern volatile __bit                   LC5D3S7             __at(0x729F);	// @ (0xE53 * 8 + 7)
#define                                 LC5D3S7_bit         _BIT_ACCESS(CLC5SEL2,7)
// CLC5SEL3<LC5D4S0>
extern volatile __bit                   LC5D4S0             __at(0x72A0);	// @ (0xE54 * 8 + 0)
#define                                 LC5D4S0_bit         _BIT_ACCESS(CLC5SEL3,0)
// CLC5SEL3<LC5D4S1>
extern volatile __bit                   LC5D4S1             __at(0x72A1);	// @ (0xE54 * 8 + 1)
#define                                 LC5D4S1_bit         _BIT_ACCESS(CLC5SEL3,1)
// CLC5SEL3<LC5D4S2>
extern volatile __bit                   LC5D4S2             __at(0x72A2);	// @ (0xE54 * 8 + 2)
#define                                 LC5D4S2_bit         _BIT_ACCESS(CLC5SEL3,2)
// CLC5SEL3<LC5D4S3>
extern volatile __bit                   LC5D4S3             __at(0x72A3);	// @ (0xE54 * 8 + 3)
#define                                 LC5D4S3_bit         _BIT_ACCESS(CLC5SEL3,3)
// CLC5SEL3<LC5D4S4>
extern volatile __bit                   LC5D4S4             __at(0x72A4);	// @ (0xE54 * 8 + 4)
#define                                 LC5D4S4_bit         _BIT_ACCESS(CLC5SEL3,4)
// CLC5SEL3<LC5D4S5>
extern volatile __bit                   LC5D4S5             __at(0x72A5);	// @ (0xE54 * 8 + 5)
#define                                 LC5D4S5_bit         _BIT_ACCESS(CLC5SEL3,5)
// CLC5SEL3<LC5D4S6>
extern volatile __bit                   LC5D4S6             __at(0x72A6);	// @ (0xE54 * 8 + 6)
#define                                 LC5D4S6_bit         _BIT_ACCESS(CLC5SEL3,6)
// CLC5SEL3<LC5D4S7>
extern volatile __bit                   LC5D4S7             __at(0x72A7);	// @ (0xE54 * 8 + 7)
#define                                 LC5D4S7_bit         _BIT_ACCESS(CLC5SEL3,7)
// CLC5CON<LC5EN>
extern volatile __bit                   LC5EN               __at(0x727F);	// @ (0xE4F * 8 + 7)
#define                                 LC5EN_bit           _BIT_ACCESS(CLC5CON,7)
// CLC5GLS0<LC5G1D1N>
extern volatile __bit                   LC5G1D1N            __at(0x72A8);	// @ (0xE55 * 8 + 0)
#define                                 LC5G1D1N_bit        _BIT_ACCESS(CLC5GLS0,0)
// CLC5GLS0<LC5G1D1T>
extern volatile __bit                   LC5G1D1T            __at(0x72A9);	// @ (0xE55 * 8 + 1)
#define                                 LC5G1D1T_bit        _BIT_ACCESS(CLC5GLS0,1)
// CLC5GLS0<LC5G1D2N>
extern volatile __bit                   LC5G1D2N            __at(0x72AA);	// @ (0xE55 * 8 + 2)
#define                                 LC5G1D2N_bit        _BIT_ACCESS(CLC5GLS0,2)
// CLC5GLS0<LC5G1D2T>
extern volatile __bit                   LC5G1D2T            __at(0x72AB);	// @ (0xE55 * 8 + 3)
#define                                 LC5G1D2T_bit        _BIT_ACCESS(CLC5GLS0,3)
// CLC5GLS0<LC5G1D3N>
extern volatile __bit                   LC5G1D3N            __at(0x72AC);	// @ (0xE55 * 8 + 4)
#define                                 LC5G1D3N_bit        _BIT_ACCESS(CLC5GLS0,4)
// CLC5GLS0<LC5G1D3T>
extern volatile __bit                   LC5G1D3T            __at(0x72AD);	// @ (0xE55 * 8 + 5)
#define                                 LC5G1D3T_bit        _BIT_ACCESS(CLC5GLS0,5)
// CLC5GLS0<LC5G1D4N>
extern volatile __bit                   LC5G1D4N            __at(0x72AE);	// @ (0xE55 * 8 + 6)
#define                                 LC5G1D4N_bit        _BIT_ACCESS(CLC5GLS0,6)
// CLC5GLS0<LC5G1D4T>
extern volatile __bit                   LC5G1D4T            __at(0x72AF);	// @ (0xE55 * 8 + 7)
#define                                 LC5G1D4T_bit        _BIT_ACCESS(CLC5GLS0,7)
// CLC5POL<LC5G1POL>
extern volatile __bit                   LC5G1POL            __at(0x7280);	// @ (0xE50 * 8 + 0)
#define                                 LC5G1POL_bit        _BIT_ACCESS(CLC5POL,0)
// CLC5GLS1<LC5G2D1N>
extern volatile __bit                   LC5G2D1N            __at(0x72B0);	// @ (0xE56 * 8 + 0)
#define                                 LC5G2D1N_bit        _BIT_ACCESS(CLC5GLS1,0)
// CLC5GLS1<LC5G2D1T>
extern volatile __bit                   LC5G2D1T            __at(0x72B1);	// @ (0xE56 * 8 + 1)
#define                                 LC5G2D1T_bit        _BIT_ACCESS(CLC5GLS1,1)
// CLC5GLS1<LC5G2D2N>
extern volatile __bit                   LC5G2D2N            __at(0x72B2);	// @ (0xE56 * 8 + 2)
#define                                 LC5G2D2N_bit        _BIT_ACCESS(CLC5GLS1,2)
// CLC5GLS1<LC5G2D2T>
extern volatile __bit                   LC5G2D2T            __at(0x72B3);	// @ (0xE56 * 8 + 3)
#define                                 LC5G2D2T_bit        _BIT_ACCESS(CLC5GLS1,3)
// CLC5GLS1<LC5G2D3N>
extern volatile __bit                   LC5G2D3N            __at(0x72B4);	// @ (0xE56 * 8 + 4)
#define                                 LC5G2D3N_bit        _BIT_ACCESS(CLC5GLS1,4)
// CLC5GLS1<LC5G2D3T>
extern volatile __bit                   LC5G2D3T            __at(0x72B5);	// @ (0xE56 * 8 + 5)
#define                                 LC5G2D3T_bit        _BIT_ACCESS(CLC5GLS1,5)
// CLC5GLS1<LC5G2D4N>
extern volatile __bit                   LC5G2D4N            __at(0x72B6);	// @ (0xE56 * 8 + 6)
#define                                 LC5G2D4N_bit        _BIT_ACCESS(CLC5GLS1,6)
// CLC5GLS1<LC5G2D4T>
extern volatile __bit                   LC5G2D4T            __at(0x72B7);	// @ (0xE56 * 8 + 7)
#define                                 LC5G2D4T_bit        _BIT_ACCESS(CLC5GLS1,7)
// CLC5POL<LC5G2POL>
extern volatile __bit                   LC5G2POL            __at(0x7281);	// @ (0xE50 * 8 + 1)
#define                                 LC5G2POL_bit        _BIT_ACCESS(CLC5POL,1)
// CLC5GLS2<LC5G3D1N>
extern volatile __bit                   LC5G3D1N            __at(0x72B8);	// @ (0xE57 * 8 + 0)
#define                                 LC5G3D1N_bit        _BIT_ACCESS(CLC5GLS2,0)
// CLC5GLS2<LC5G3D1T>
extern volatile __bit                   LC5G3D1T            __at(0x72B9);	// @ (0xE57 * 8 + 1)
#define                                 LC5G3D1T_bit        _BIT_ACCESS(CLC5GLS2,1)
// CLC5GLS2<LC5G3D2N>
extern volatile __bit                   LC5G3D2N            __at(0x72BA);	// @ (0xE57 * 8 + 2)
#define                                 LC5G3D2N_bit        _BIT_ACCESS(CLC5GLS2,2)
// CLC5GLS2<LC5G3D2T>
extern volatile __bit                   LC5G3D2T            __at(0x72BB);	// @ (0xE57 * 8 + 3)
#define                                 LC5G3D2T_bit        _BIT_ACCESS(CLC5GLS2,3)
// CLC5GLS2<LC5G3D3N>
extern volatile __bit                   LC5G3D3N            __at(0x72BC);	// @ (0xE57 * 8 + 4)
#define                                 LC5G3D3N_bit        _BIT_ACCESS(CLC5GLS2,4)
// CLC5GLS2<LC5G3D3T>
extern volatile __bit                   LC5G3D3T            __at(0x72BD);	// @ (0xE57 * 8 + 5)
#define                                 LC5G3D3T_bit        _BIT_ACCESS(CLC5GLS2,5)
// CLC5GLS2<LC5G3D4N>
extern volatile __bit                   LC5G3D4N            __at(0x72BE);	// @ (0xE57 * 8 + 6)
#define                                 LC5G3D4N_bit        _BIT_ACCESS(CLC5GLS2,6)
// CLC5GLS2<LC5G3D4T>
extern volatile __bit                   LC5G3D4T            __at(0x72BF);	// @ (0xE57 * 8 + 7)
#define                                 LC5G3D4T_bit        _BIT_ACCESS(CLC5GLS2,7)
// CLC5POL<LC5G3POL>
extern volatile __bit                   LC5G3POL            __at(0x7282);	// @ (0xE50 * 8 + 2)
#define                                 LC5G3POL_bit        _BIT_ACCESS(CLC5POL,2)
// CLC5GLS3<LC5G4D1N>
extern volatile __bit                   LC5G4D1N            __at(0x72C0);	// @ (0xE58 * 8 + 0)
#define                                 LC5G4D1N_bit        _BIT_ACCESS(CLC5GLS3,0)
// CLC5GLS3<LC5G4D1T>
extern volatile __bit                   LC5G4D1T            __at(0x72C1);	// @ (0xE58 * 8 + 1)
#define                                 LC5G4D1T_bit        _BIT_ACCESS(CLC5GLS3,1)
// CLC5GLS3<LC5G4D2N>
extern volatile __bit                   LC5G4D2N            __at(0x72C2);	// @ (0xE58 * 8 + 2)
#define                                 LC5G4D2N_bit        _BIT_ACCESS(CLC5GLS3,2)
// CLC5GLS3<LC5G4D2T>
extern volatile __bit                   LC5G4D2T            __at(0x72C3);	// @ (0xE58 * 8 + 3)
#define                                 LC5G4D2T_bit        _BIT_ACCESS(CLC5GLS3,3)
// CLC5GLS3<LC5G4D3N>
extern volatile __bit                   LC5G4D3N            __at(0x72C4);	// @ (0xE58 * 8 + 4)
#define                                 LC5G4D3N_bit        _BIT_ACCESS(CLC5GLS3,4)
// CLC5GLS3<LC5G4D3T>
extern volatile __bit                   LC5G4D3T            __at(0x72C5);	// @ (0xE58 * 8 + 5)
#define                                 LC5G4D3T_bit        _BIT_ACCESS(CLC5GLS3,5)
// CLC5GLS3<LC5G4D4N>
extern volatile __bit                   LC5G4D4N            __at(0x72C6);	// @ (0xE58 * 8 + 6)
#define                                 LC5G4D4N_bit        _BIT_ACCESS(CLC5GLS3,6)
// CLC5GLS3<LC5G4D4T>
extern volatile __bit                   LC5G4D4T            __at(0x72C7);	// @ (0xE58 * 8 + 7)
#define                                 LC5G4D4T_bit        _BIT_ACCESS(CLC5GLS3,7)
// CLC5POL<LC5G4POL>
extern volatile __bit                   LC5G4POL            __at(0x7283);	// @ (0xE50 * 8 + 3)
#define                                 LC5G4POL_bit        _BIT_ACCESS(CLC5POL,3)
// CLC5CON<LC5INTN>
extern volatile __bit                   LC5INTN             __at(0x727B);	// @ (0xE4F * 8 + 3)
#define                                 LC5INTN_bit         _BIT_ACCESS(CLC5CON,3)
// CLC5CON<LC5INTP>
extern volatile __bit                   LC5INTP             __at(0x727C);	// @ (0xE4F * 8 + 4)
#define                                 LC5INTP_bit         _BIT_ACCESS(CLC5CON,4)
// CLC5CON<LC5MODE0>
extern volatile __bit                   LC5MODE0            __at(0x7278);	// @ (0xE4F * 8 + 0)
#define                                 LC5MODE0_bit        _BIT_ACCESS(CLC5CON,0)
// CLC5CON<LC5MODE1>
extern volatile __bit                   LC5MODE1            __at(0x7279);	// @ (0xE4F * 8 + 1)
#define                                 LC5MODE1_bit        _BIT_ACCESS(CLC5CON,1)
// CLC5CON<LC5MODE2>
extern volatile __bit                   LC5MODE2            __at(0x727A);	// @ (0xE4F * 8 + 2)
#define                                 LC5MODE2_bit        _BIT_ACCESS(CLC5CON,2)
// CLC5CON<LC5OUT>
extern volatile __bit                   LC5OUT              __at(0x727D);	// @ (0xE4F * 8 + 5)
#define                                 LC5OUT_bit          _BIT_ACCESS(CLC5CON,5)
// CLC5POL<LC5POL>
extern volatile __bit                   LC5POL              __at(0x7287);	// @ (0xE50 * 8 + 7)
#define                                 LC5POL_bit          _BIT_ACCESS(CLC5POL,7)
// CLC6SEL0<LC6D1S0>
extern volatile __bit                   LC6D1S0             __at(0x72D8);	// @ (0xE5B * 8 + 0)
#define                                 LC6D1S0_bit         _BIT_ACCESS(CLC6SEL0,0)
// CLC6SEL0<LC6D1S1>
extern volatile __bit                   LC6D1S1             __at(0x72D9);	// @ (0xE5B * 8 + 1)
#define                                 LC6D1S1_bit         _BIT_ACCESS(CLC6SEL0,1)
// CLC6SEL0<LC6D1S2>
extern volatile __bit                   LC6D1S2             __at(0x72DA);	// @ (0xE5B * 8 + 2)
#define                                 LC6D1S2_bit         _BIT_ACCESS(CLC6SEL0,2)
// CLC6SEL0<LC6D1S3>
extern volatile __bit                   LC6D1S3             __at(0x72DB);	// @ (0xE5B * 8 + 3)
#define                                 LC6D1S3_bit         _BIT_ACCESS(CLC6SEL0,3)
// CLC6SEL0<LC6D1S4>
extern volatile __bit                   LC6D1S4             __at(0x72DC);	// @ (0xE5B * 8 + 4)
#define                                 LC6D1S4_bit         _BIT_ACCESS(CLC6SEL0,4)
// CLC6SEL0<LC6D1S5>
extern volatile __bit                   LC6D1S5             __at(0x72DD);	// @ (0xE5B * 8 + 5)
#define                                 LC6D1S5_bit         _BIT_ACCESS(CLC6SEL0,5)
// CLC6SEL0<LC6D1S6>
extern volatile __bit                   LC6D1S6             __at(0x72DE);	// @ (0xE5B * 8 + 6)
#define                                 LC6D1S6_bit         _BIT_ACCESS(CLC6SEL0,6)
// CLC6SEL0<LC6D1S7>
extern volatile __bit                   LC6D1S7             __at(0x72DF);	// @ (0xE5B * 8 + 7)
#define                                 LC6D1S7_bit         _BIT_ACCESS(CLC6SEL0,7)
// CLC6SEL1<LC6D2S0>
extern volatile __bit                   LC6D2S0             __at(0x72E0);	// @ (0xE5C * 8 + 0)
#define                                 LC6D2S0_bit         _BIT_ACCESS(CLC6SEL1,0)
// CLC6SEL1<LC6D2S1>
extern volatile __bit                   LC6D2S1             __at(0x72E1);	// @ (0xE5C * 8 + 1)
#define                                 LC6D2S1_bit         _BIT_ACCESS(CLC6SEL1,1)
// CLC6SEL1<LC6D2S2>
extern volatile __bit                   LC6D2S2             __at(0x72E2);	// @ (0xE5C * 8 + 2)
#define                                 LC6D2S2_bit         _BIT_ACCESS(CLC6SEL1,2)
// CLC6SEL1<LC6D2S3>
extern volatile __bit                   LC6D2S3             __at(0x72E3);	// @ (0xE5C * 8 + 3)
#define                                 LC6D2S3_bit         _BIT_ACCESS(CLC6SEL1,3)
// CLC6SEL1<LC6D2S4>
extern volatile __bit                   LC6D2S4             __at(0x72E4);	// @ (0xE5C * 8 + 4)
#define                                 LC6D2S4_bit         _BIT_ACCESS(CLC6SEL1,4)
// CLC6SEL1<LC6D2S5>
extern volatile __bit                   LC6D2S5             __at(0x72E5);	// @ (0xE5C * 8 + 5)
#define                                 LC6D2S5_bit         _BIT_ACCESS(CLC6SEL1,5)
// CLC6SEL1<LC6D2S6>
extern volatile __bit                   LC6D2S6             __at(0x72E6);	// @ (0xE5C * 8 + 6)
#define                                 LC6D2S6_bit         _BIT_ACCESS(CLC6SEL1,6)
// CLC6SEL1<LC6D2S7>
extern volatile __bit                   LC6D2S7             __at(0x72E7);	// @ (0xE5C * 8 + 7)
#define                                 LC6D2S7_bit         _BIT_ACCESS(CLC6SEL1,7)
// CLC6SEL2<LC6D3S0>
extern volatile __bit                   LC6D3S0             __at(0x72E8);	// @ (0xE5D * 8 + 0)
#define                                 LC6D3S0_bit         _BIT_ACCESS(CLC6SEL2,0)
// CLC6SEL2<LC6D3S1>
extern volatile __bit                   LC6D3S1             __at(0x72E9);	// @ (0xE5D * 8 + 1)
#define                                 LC6D3S1_bit         _BIT_ACCESS(CLC6SEL2,1)
// CLC6SEL2<LC6D3S2>
extern volatile __bit                   LC6D3S2             __at(0x72EA);	// @ (0xE5D * 8 + 2)
#define                                 LC6D3S2_bit         _BIT_ACCESS(CLC6SEL2,2)
// CLC6SEL2<LC6D3S3>
extern volatile __bit                   LC6D3S3             __at(0x72EB);	// @ (0xE5D * 8 + 3)
#define                                 LC6D3S3_bit         _BIT_ACCESS(CLC6SEL2,3)
// CLC6SEL2<LC6D3S4>
extern volatile __bit                   LC6D3S4             __at(0x72EC);	// @ (0xE5D * 8 + 4)
#define                                 LC6D3S4_bit         _BIT_ACCESS(CLC6SEL2,4)
// CLC6SEL2<LC6D3S5>
extern volatile __bit                   LC6D3S5             __at(0x72ED);	// @ (0xE5D * 8 + 5)
#define                                 LC6D3S5_bit         _BIT_ACCESS(CLC6SEL2,5)
// CLC6SEL2<LC6D3S6>
extern volatile __bit                   LC6D3S6             __at(0x72EE);	// @ (0xE5D * 8 + 6)
#define                                 LC6D3S6_bit         _BIT_ACCESS(CLC6SEL2,6)
// CLC6SEL2<LC6D3S7>
extern volatile __bit                   LC6D3S7             __at(0x72EF);	// @ (0xE5D * 8 + 7)
#define                                 LC6D3S7_bit         _BIT_ACCESS(CLC6SEL2,7)
// CLC6SEL3<LC6D4S0>
extern volatile __bit                   LC6D4S0             __at(0x72F0);	// @ (0xE5E * 8 + 0)
#define                                 LC6D4S0_bit         _BIT_ACCESS(CLC6SEL3,0)
// CLC6SEL3<LC6D4S1>
extern volatile __bit                   LC6D4S1             __at(0x72F1);	// @ (0xE5E * 8 + 1)
#define                                 LC6D4S1_bit         _BIT_ACCESS(CLC6SEL3,1)
// CLC6SEL3<LC6D4S2>
extern volatile __bit                   LC6D4S2             __at(0x72F2);	// @ (0xE5E * 8 + 2)
#define                                 LC6D4S2_bit         _BIT_ACCESS(CLC6SEL3,2)
// CLC6SEL3<LC6D4S3>
